# Terraform plan for production

```
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Terraform Plan Details</summary>

```
data.local_file.cluster_jwks: Reading...
data.local_file.cluster_jwks: Read complete after 0s [id=e377889b045ce34078867b445e6677e624e244d9]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=terraform-remote-backend.piny940.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=clubroom.piny940.com]
module.clubroom.google_service_account.clubroom: Refreshing state... [id=projects/prd-piny940/serviceAccounts/clubroom@prd-piny940.iam.gserviceaccount.com]
module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=prd-piny940/iamcredentials.googleapis.com]
module.portfolio.google_service_account.portfolio: Refreshing state... [id=projects/prd-piny940/serviceAccounts/portfolio@prd-piny940.iam.gserviceaccount.com]
module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool]
module.portfolio.google_storage_bucket.portfolio: Refreshing state... [id=portfolio.piny940.com]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.portfolio.google_project_iam_member.portfolio_service_account_token_creator: Refreshing state... [id=prd-piny940/roles/iam.serviceAccountTokenCreator/serviceAccount:portfolio@prd-piny940.iam.gserviceaccount.com]
module.portfolio.google_project_iam_member.portfolio_storage_object_user: Refreshing state... [id=prd-piny940/roles/storage.objectUser/serviceAccount:portfolio@prd-piny940.iam.gserviceaccount.com]
module.clubroom.google_project_iam_member.clubroom_service_account_token_creator: Refreshing state... [id=prd-piny940/roles/iam.serviceAccountTokenCreator/serviceAccount:clubroom@prd-piny940.iam.gserviceaccount.com]
module.clubroom.google_project_iam_member.clubroom_storage_object_user: Refreshing state... [id=prd-piny940/roles/storage.objectUser/serviceAccount:clubroom@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=prd-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_owner: Refreshing state... [id=prd-piny940/roles/owner/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_service_account_iam_member.terraform_github_actions_env_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:environment:production]
module.terraform.google_iam_workload_identity_pool_provider.repo_github_actions: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/repo-github-actions]
module.clubroom.google_service_account_iam_member.ksa_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/clubroom@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:clubroom]
module.terraform.google_service_account_iam_member.terraform_github_actions_branch_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:ref:refs/heads/main]
module.kube_workload_identity.google_iam_workload_identity_pool_provider.home_kubernetes: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/home-kubernetes]
module.terraform.google_service_account_iam_member.terraform_github_actions_pull_request_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:pull_request]
module.portfolio.google_service_account_iam_member.ksa_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/portfolio@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:portfolio-backend]
module.portfolio.google_storage_bucket_iam_member.portfolio_public_access: Refreshing state... [id=b/portfolio.piny940.com/roles/storage.objectViewer/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.clubroom will be created
  + resource "google_storage_bucket" "clubroom" {
      + effective_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "proxmox-remote-backend.piny940.com"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
<!-- Sticky Pull Request CommentGCP Plan for production -->